<!-- eslint-disable vue/no-irregular-whitespace -->
<!-- eslint-disable no-irregular-whitespace -->
<template>
  <view>
    <h1 class="mt-40rpx text-center text-32rpx">
      产业链财金管理系统服务协议
    </h1>
    <view class="mt-32rpx px-30rpx text-26rpx text-[#333]">
      产业链财金管理系统（以下简称本系统）是青岛市黄岛区供销合作社联合社（以下简称本企业）拥有全部权利的产品，因此，本服务协议由青岛市黄岛区供销合作社联合社和您满足。<br>
      您理解并同意，本企业非金融机构，基于金融机构的系统支付服务，本协议项下的资金转移均通过中国工商银行和通联支付来实现，您需遵照中国工商银行、通联支付和相关监管机构的管理规定。<br>
      一、声明与承诺<br>
      （一）在接受本协议或本企业允许的其他方式实际使用本系统服务之前，请您仔细阅读本协议的全部内容。如果您不同意本协议的任何内容，或者无法准确理解本企业对条款的解释，请不要进行后续操作，包括但不限于不接受本协议，不使用本服务。<br>
      （二）您同意，如本企业需要对本协议进行变更或修改的，须通过本系统网站公告的方式提前收录，​​公告期限届满后立即生效；若您在本协议内容公告变更后继续使用本系统服务的，表示您已充分阅读、理解并接受变更后的协议内容，也将遵循变更后的协议内容使用本系统服务；如果您不同意变更后的协议内容，您应在变更生效前停止使用本系统服务。<br>
      （三）您是非自然人，则您确认，在您使用本系统服务时，您为在中国大陆地区合法设立并有效存续的法人或其他组织并开展经营活动；若您在其他地区，需且保证您订购并履行本协议不受您的居住、居住或经营或其他业务的国家或地区法律法规的禁止。不具备全部活动条件的，您应立即终止注册或停止使用本系统服务。<br>
      您是自然人，需完全民事行为能力人；如您为无民事行为能力人或为限制民事行为能力人或未满18周岁，则不能使用本系统服务，若您使用产生的法律责任和法律义务由您及您的监护人全部承担，与本系统相关。<br>
      （四）您在使用本系统服务时，应自行判断您的交易对方是否具备完全民事行为能力，并自行决定双方是否使用本系统，且您应自行承担与此相关的一切风险。
    </view>
  </view>
</template>

<route lang="yaml">
  style:
    navigationBarTitleText: '注册协议'
</route>
